class DailyCheckUpController{

  var dailyCheckUpListQuestion= [
    "النوم",
    "الحالة النفسية",
    "الشعور بالتعب",
    "الشعور بالالم",
    "درجة الحرارة",
    "الشعور بالدفئ",
    "صعوبة التنفس",
    "الشهية",
    "الشعور بالغثيان",
    "الوزن",
    "تورم او كدمات",
    "تقرحات بالفم",
    "طفح جلدي",
    "الم في العين",
    "الم باماكن الحقن",
    "ضغط الدم",
    "مشاكل بعملية الاخراج",
    "عسر الهضم",
    "فقدان التركيز",
    "التعرض للنزيف",
  ];



  var dailyCheckUpListAnswer= [
    "نوم متقطع",
    "عادية",
    "اشعر بتعب متوسط",
    "اشعر بالصداع",
    "37.2",
    "لا",
    "احيانا",
    "متعدلة",
    "لا",
    "35 Kg",
    "كدمات في الساق",
    "لا",
    "لا",
    "الم وسيلان بالعين اليسري",
    "لا",
    "90/60",
    "امساك",
    "قليلا",
    "احيانا",
    "نعم,نزيف في اللثة",
];


var dotting=[
  ":",
  "\t : ",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",
  ":",

];



}