class ReverseController {
  late bool isCanceled;


  Map<String, List<dynamic>> doctorCard = {
    'image': [
      'assets/images/me.jpg',
      'assets/images/doctor3.jpg',
      'assets/images/doctorah.jpg',
      'assets/images/me.jpg',
      'assets/images/doctor3.jpg',
      'assets/images/doctorah.jpg',
      'assets/images/doctorah.jpg',
    ],
    'name': [
      'دكتور خالد الغنيمي',
      'دكتور تامر مصطفي',
      'دكتورة إيناس محمد',
      'احمد باشا',
      'عمرو وهبة',
      'تسنيم رزق',
      'محمد السيد صقر',
    ],
    'description': [
      'علاج الأورام بالإشعاع',
      'علاج الأورام بالإشعاع',
      'علاج الأورام بالغين',
      'علاج الأورام بالإشعاع',
      'علاج الأورام بالإشعاع',
      'علاج الأورام بالغين',
      'علاج الأورام بالغين',
    ],
    'specialization':[
      'إستشاري علاج الأورام و عضو هيئة \nالتدريس في جامعة عين شمس ',
      'متخصص في علاج الأورام بالإشعاع_أورام بالغين ',
      'استشاري علاج الأورام _ كلية الطب جامعة المنصورة',
      'متخصص في علاج الأورام بالإشعاع - أورام بالغين',
      'إستشاري علاج الأورام و عضو هيئة \nالتدريس في جامعة عين شمس ',
      'متخصص في علاج الأورام بالإشعاع_أورام بالغين ',
      'استشاري علاج الأورام _ كلية الطب جامعة المنصورة',
    ],
    'isCanceled': [false,true, false ,true,false,true,true],
    'location': [
      'مصرالجديدة_شارع عثمان بن عفان_الإسماعيلية',
      'مصرالجديدة_شارع عثمان بن عفان_الإسماعيلية',
      'الدقهلية_شارع الجلاء _المنصورة',
      'الدقهلية_شارع الجلاء _المنصورة',
      'مصرالجديدة_شارع عثمان بن عفان_الإسماعيلية',
      'مصر الجديدة_ شارع الخليفة الأمون',
      'مصرالجديدة_شارع عثمان بن عفان_الإسماعيلية',
    ],
    'cost': [
      'رسوم الكشف :250 جنية',
      'رسوم الكشف :300 جنية',
      'رسوم الكشف :300 جنية',
      'رسوم الكشف :300 جنية',
      'رسوم الكشف :300 جنية',
      'رسوم الكشف :300 جنية',
      'رسوم الكشف :200 جنية'
    ],
    'time': [
      'السبت 5 مارس 6:00 مساءً',
      'الخميس 10 مارس 10:00 صباحاً',
      'السبت 11 مارس 6:00 صباحاً',
      'السبت 5 مارس 6:00 مساءً',
      'الخميس 10 مارس 10:00 صباحاً',
      'السبت 11 مارس 6:00 صباحاً',
          'السبت 11 مارس 6:00 صباحاً'
    ],
  };


}
