 class ReverseController{


  Map<String,List<dynamic>>doctorCard={
    'image':['assets/images/me.jpg','assets/images/doctor3.jpg','assets/images/doctorah.jpg'],
    'name':['دكتور خالد الغنيمي','دكتور تامر مصطفي','دكتورة إيناس محمد'],
    'description':['علاج الأورام بالإشعاع','علاج الأورام بالإشعاع','علاج الأورام بالغين'],
    'isCanceled':[false,false,false],
    'location':[
      'مصرالجديدة_شارع عثمان بن عفان_الإسماعيلية',
      'الدقهلية_شارع الجلاء _المنصورة',
      'مصر الجديدة_ شارع الخليفة الأمون'],
    'cost':['رسوم الكشف :300 جنية','رسوم الكشف :300 جنية','رسوم الكشف :300 جنية'],
    'time':['السبت 5 مارس 6:00 مساءً','الخميس 10 مارس 10:00 صباحاً','السبت 11 مارس 6:00 صباحاً'],
  };







}