import 'package:dio/dio.dart';

class BlogsController{
  var data=[
    "\n""سرطان الثدي الالتهابي نوع نادر من سرطان الثدي يتطور بسرعة جاعلاً الثدي المصاب أحمر اللون ومتورمًا ومؤلمًا عند اللمس."
        "\n"  " يحدث سرطان الثدي الالتهابي عندما تسد الخلايا السرطانية الأوعية الليمفاوية في الجلد الذي يغطي الثدي، ما يتسبب في احمرار لون الثدي وتورّمه."
        "\n" " يعتبر سرطان الثدي الالتهابي سرطانًا متطورًا موضعيًا؛ ما يعني أنه ينتشر من نقطة بدايته إلى الأنسجة القريبة وربما إلى العُقَد اللمفية القريبة."
        "\n" " يمكن الخلط بسهولة بين سرطان الثدي الالتهابي وعدوى التهاب الثدي، الذي يُعد السبب الأكثر شيوعًا لاحمرار الثدي وتورمه."
        "\n"  " وفي حال لاحظتِ تغيرًا في شكل جلد ثديك، اطلبي الرعاية الطبية على الفور.",
    "\n" "سرطان الثدي المتكرر هو السرطان الذي يعود بعد العلاج الأولي."
        "\n"" على الرغم من أن العلاج الأولي مفضل في علاج كل السرطانات، فإن قليلًا من الخلايا قد يقاوم ويعيش."
        "\n"" تُصبح هذه الخلايا السرطانية غير المعروفة سرطان الثدي المتكرر."
        "\n"  " ربما تصابين بسرطان الثدي المتكرر بعد شهور أو سنين من علاجه. "
        "\n" "ربما يعود السرطان إلى نفس المكان الذي كان فيه من قبل (التكرار في مكانه) أو ينتشر في أماكن أخرى في جسمك (التكرار البعيد)."
        "\n" " إخباركِ بأنكِ مصابة بسرطان الثدي المتكرر أصعب من التشخيص الأولي."
        "\n" " لكن إصابتكِ بسرطان الثدي المتكرر بعيدة عن اليأس."
        "\n"  " ربما يزيل العلاج سرطان الثدي المتكرر في نفس المكان أو في منطقة أخرى بعيدة. حتى لو لم يكن العلاج متاحًا، فقد يُسيطَر على المرض لفترات طويلة من الوقت.",
    "\n""إن الفحص الذاتي للثديين للوعي بحالتهما فحص للثديين تُجرينه بذاتك."
        "\n"  " للمساعدة على زيادة الوعي بالثديين، يجب أن تستخدمي العينين واليدين لتحديد ما إذا كانت هناك أيّ تغيرات في شكل وملمس الثديين. "
        "\n" "إذا لاحظت وجود تغيرات جديدة في الثدي، ينبغي مناقشتها مع الطبيب."
        "\n" " بالرغم أن معظم التغيرات المُكتشَفة في الثدي خلال الفحص الذاتي للوعي بحالة الثديين كانت أسبابها حميدة، فقد تشير بعض التغيرات إلى الإصابة بشيء خطير، مثل سرطان الثدي."
        "\n" " لا تنصح معظم المؤسسات الطبية بإجراء الفحوصات الذاتية المنتظمة للثديين كجزء من فحص سرطان الثدي."
        "\n" " هذا لأنه لم تتبين فاعلية الفحوصات الذاتية للثديين من حيث اكتشاف السرطان أو تحسين معدل نجاة النساء اللاتي لديهن سرطان الثدي."
        "\n"   " ومع ذلك، لا يزال الأطباء يعتقدون أن هناك فائدة من أن تكون النساء على دراية بأثدائهن حتى تُدركن ما الطبيعي وتُبلِغن عن التغيرات على الفور.",
    "\n"  "قد تتضمن علامات سرطان الثدي وأعراضه ما يلي:"
    "\n"

        " 1- كتلة أو تثخنًا في الثدي يَختلف عن الأنسجة المحيطة"

    "\n"
        " 2-تغيُّرًا في حجم الثدي أو شكله أو مظهره"
    "\n"
        " 3-تغيُّرًا في الجلد الموجود على الثدي، مثل الترصُّع"
    "\n"
        " 4-الحلمة المقلوبة حديثة الظهور"
    "\n"
        " 5-تقشُّرًا أو توسفًا أو تيبسًا أو تساقطًا في المنطقة المصطبغة من الجلد المحيط بالحلمة (الهالة) أو جلد الثدي"
    "\n"
        " 6-احمرار جلد الثدي أو تنقيره، مثل جلد البرتقالة",
  ];
  var labels=["سرطان الثدي الالتهابي","سرطان الثدي المتكرر","الفحص الذاتي الشخصي","اعراض سرطان الثدي"];
}
final dio = Dio();

void getHttp() async {
  final response = await dio.get('https://zahra2023.000webhostapp.com/api/blogs');
  print(response);
}

